WS_BVC_Dummy/src/conf/wsdl/OrderNotification/Service0106.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--Created by TIBCO WSDL-->
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://www.bvc.com.co/Services/Service0106" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns="http://www.bvc.com.co/BUS" xmlns:ns1="http://www.fixprotocol.org/FIXML-5-0" name="Untitled" targetNamespace="http://www.bvc.com.co/Services/Service0106">
    <wsdl:types>
        <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.bvc.com.co/BUS" elementFormDefault="qualified" attributeFormDefault="unqualified">
            <xs:include schemaLocation="../Schemas/BusApp/FirmInfo.xsd"/>
        </xs:schema>
        <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.fixprotocol.org/FIXML-5-0" elementFormDefault="qualified" attributeFormDefault="unqualified">
            <xs:include schemaLocation="../Schemas/FIXML/fixml-order-impl-5-0.xsd"/>
        </xs:schema>
    </wsdl:types>
    <wsdl:service name="Service0106">
        <wsdl:port name="portTypeEndpoint" binding="tns:portTypeEndpointBinding">
            <soap:address location="https://busintegracion.bvc.com.co:443/Services/Service0106/Interface/Service0106.serviceagent/portTypeEndpoint"/>
        </wsdl:port>
    </wsdl:service>
    <wsdl:portType name="portType">
        <wsdl:operation name="NotificacionOrdenesRqstOp">
            <wsdl:input message="tns:firm"/>
            <wsdl:output message="tns:FIXML"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="portTypeEndpointBinding" type="tns:portType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="NotificacionOrdenesRqstOp">
            <soap:operation style="document" soapAction="/Services/Service0106/Interface/Service0106.serviceagent/portTypeEndpoint/NotificacionOrdenesRqstOp"/>
            <wsdl:input>
                <soap:body use="literal" parts="parameters1"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" parts="parameters2"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:message name="firm">
        <wsdl:part name="parameters1" element="ns:firm"/>
    </wsdl:message>
    <wsdl:message name="FIXML">
        <wsdl:part name="parameters2" element="ns1:FIXML"/>
    </wsdl:message>
</wsdl:definitions>